app/Controllers/Inicio.php

    public function index()
    {
        $total_clientes = count(
            $this->cliente_model->findAll()
        );

        $total_produtos = count(
            $this->produto_model->findAll()
        );

        $total_funcionarios = count(
            $this->funcionario_model->findAll()
        );
---
SELECT *
FROM `clientes`
SELECT *
FROM `produtos`
SELECT *
FROM `funcionarios`