app/Controllers/Login.php

SELECT *
FROM `logins`
WHERE `usuario` = 'admin'
AND `senha` = '202cb962ac59075b964b07152d234b70'
 LIMIT 1
---
    public function autenticar()
    {
        $dados = $this->request->getVar();

        $usuario = $this->login_model
            ->where('usuario', $dados['usuario'])
            ->where('senha', md5($dados['senha']))
            ->first();